<?php

return [
    'status' =>  [
        1 => '待付款',
        2 => '付款确认', //客户已付款 等待财务确认
        3 => '付款成功' ,

        4 => '取消订单申请',// 订单确认后24小时内 用户不想要了 取消订单
        5 => '确认取消', // 订单但取消 退款给买家

        6 => '正在出库' , //网上订单被打印 , 同时订单在等待库房人员出库
        7 => '商品出库' , //已出库,
        8 => '等待收货' , //发货两天后 修改订单状态为等待收货
        9 => '完成' ,

        10 => '商品退库申请', //用户收到货后 不满意要退货 进行退货申请
        11 => '商家确认退库申请',
        12 => '退库中' , //买家寄回快递后
        13 => '已收到退货',
        14 => '退款',

        15 => 'hold',// 欺诈订单或其他原因

    ],
    'shipping_method' => [
        'ems' => 'Post Air' //E 邮宝
    ]
];
